Tekla.Structures.Drawing.ReinforcementMesh
The ReinforcementMesh class defines a reinforcement mesh in the drawing.

Tekla.Structures.Drawing.ReinforcementMesh.Attributes
The attributes of the reinforcement.
For more information see Tekla.Structures.Drawing.ReinforcementBase.ReinforcementMeshAttributes.

Tekla.Structures.Drawing.ReinforcementMesh.ReinforcementCustomPositionLongitudinal
Defines the location of the longitudinal wire when using ReinforcementVisibility == ReinforcementVisibilityTypes.Customized.
This location is a value between 0.0 and 1.0 and it defines the proportion from the reinforcement's start point.

Tekla.Structures.Drawing.ReinforcementMesh.ReinforcementCustomPositionCrossing
Defines the location of the crossing bar when using MeshReinforcementVisibilityCrossing == ReinforcementVisibilityTypes.Customized.
This location is a value between 0.0 and 1.0 and it defines the proportion from the mesh's start point.

Tekla.Structures.Drawing.ReinforcementMesh.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.ReinforcementMesh.#ctor
Create instance of ReinforcementMesh

Tekla.Structures.Drawing.ReinforcementMesh.#ctor(System.Boolean)
Create instance of ReinforcementMesh
SkipLoadingAttributes: If it set to true attributes won't be lodaded.